Repository: mate-desktop/mate-utils
Catalog: baobab/help/*/*.po
Languages: de

source: When you start scanning a folder, the tree of subfolders is created and listed on the left side. Each row contains information for the name, how much space it is taking up (percentage and size in KB, MB or GB) and the number of items (adding files and directories). When this process ends up, the <guilabel>Ringschart</guilabel> is drawn on the right side. If you stop it before it has been completed, only a partial representation is done based on the directories whose usage was computed.
de: Wenn Sie mit dem Einlesen eines Ordners beginnen, wird der Baum der Unterordner erstellt und auf der linken Seite aufgelistet. Jede der Spalten enthält Informationen über den Namen, den Platzverbrauch (Prozentsatz und Größe in kB, MB oder GB) und die Anzahl der enthaltenen Objekte (Dateien und Ordner). Wenn dieser Vorgang beendet ist, wird das <guilabel>Ringdiagramm</guilabel> auf der rechten Seite erstellt. Falls Sie diesen Vorgang vorzeitig beenden, erhalten Sie lediglich eine teilweise Darstellung, die auf den Ordnern basiert, die bereits eingelesen wurden.

source: Disk Usage Analyzer showing a ringschart with the usage of a folder
de: Die Festplattenbelegungsanalyse zeigt ein Ringdiagramm mit dem Platzverbrauch eines Ordners

source: After scanning a folder.
de: Nach dem Einlesen eines Ordners.

source: The <guilabel>Ringschart</guilabel> is composed of a set of nested rings around a central circle. This circle symbolizes the root folder of the partial tree (that is, the folder that the user has selected for scanning). Each ring represents a level in the partial tree, so i.e. the subfolders of the root folder will be represented in the first ring, and deeper levels in the tree correspond to outer rings in the chart. Each subfolder is represented by a sector of the ring, its angle being proportional to the size of the folder's contents, and painted with a different color to ease visualization. Up to five levels can be drawn; in case that a folder in that last fifth level contains even more subfolders, this situation will be pointed by the presence of a black curve close to the edge of that folder's ring sector. When a folder with no further subfolders is selected to be the root of the partial tree, only the inner circle will be drawn. When the mouse pointer hovers one of the folders in the graphic, it will be highlighted and a tooltip will appears with information about its name and size. If there are any subfolders, small grey tooltips will appear, indicating their names. It's possible that not all of the subfolders' names are displayed, to avoid overlappings.
de: Das <guilabel>Ringdiagramm</guilabel> wird aus einer Reihe von konzentrischen Ringen gebildet, die um einen zentralen Kreis angeordnet sind. Dieser Kreis symbolisiert den Basisordner des partiellen Dateibaums, das heißt den Ordner, den der Benutzer zum Einlesen ausgewählt hat. Jeder der Ringe stellt eine Ebene in diesem partiellen Dateibaum dar, so werden beispielsweise die Unterordner des Basisordners im ersten Ring dargestellt, und weiter außen liegende Ringe beziehen sich auf tiefer liegende Ebenen im Dateibaum. Jeder Unterordner wird durch einen Sektor des Rings dargestellt, dessen Winkel proportional zur Größe des Ordnerinhalts ist. Die Ringe werden in verschiedenen Farben dargestellt, um die Unterscheidung zu erleichtern. Bis zu fünf Ebenen können gezeichnet werden. Im Falle, dass ein Ordner in der fünften Ebene weitere Unterordner enthält, wird ein schwarzer Bogen am Rand dieses Ordnersektors gezeichnet. Falls ein Ordner als Basisordner des Baums gewählt wird, der keine weiteren Unterordner enthält, wird nur der innere Kreis gezeichnet. Wenn sie mit dem Mauszeiger über einen der Ordner in der Grafik fahren, wird dieser hervorgehoben und ein Tooltip erscheint, der Informationen über Name und Größe anzeigt. Falls es Unterordner gibt, geben kleine graue Tooltips über deren Namen Auskunft. Es ist möglich, dass nicht alle Namen der Unterordner angezeigt werden, um Überlappungen zu vermeiden.

source: You can go up and down the rows in the list (optionally expanding those with subfolders), the graphic representation will change using the selected folder as the root of the partial tree to be represented. The folders can also be navigated from the <guilabel>ringschart</guilabel> itself. If you click with the left button of your mouse inside a folder, you'll move deeper by setting the root of the graphic to that folder. If you press the middle button (no matter the place as long as you click inside the <guilabel>ringschart</guilabel> frame) you'll get the opposite behaviour, going back one step in the hierarchy.
de: Sie können in der Liste nach oben und nach unten gehen und dabei nach Ihrer Wahl die einzelnen Unterordner ausklappen. Die grafische Darstellung zeigt dabei jeweils den gewählten Ordner als Basisordner des partiellen Dateibaums an. Die Ordner sind auch über das Ringdiagramm selbst erreichbar. Wenn sie mit der linken Maustaste in einen der Ordner klicken, gelangen Sie damit tiefer in die Ordnerstruktur, indem der angeklickte Ordner als Basisordner der Grafik verwendet wird. Wenn Sie stattdessen die mittlere Maustaste verwenden (wobei der Ort des Anklickens keine Rolle spielt, solange Sie im Rahmen des <guilabel>Ringdiagramms</guilabel> bleiben), kehren Sie damit dieses Verhalten um und gelangen in der Ordnerhierarchie eine Ebene höher.

source: The percentage of its parent's radius that is used by a given folder is directly proportional to the relation between it's own size and its parent's. It's easy to understand that the size of a folder is equal or smaller than its parent's. Although only directories are shown in this graphical representation, files are taken into account to calculate the amount of space occupied by folders.
de: Der Prozentsatz des Radius des Eltern-Ordners eines bestimmten Ordners ist direkt proportional zur Beziehung zwischen seiner eigenen Größe und der Größe des Eltern-Ordners. Es ist leicht zu begreifen, dass die Größe eines Ordners kleiner oder gleich der Größe seines Eltern-Ordners sein muss. Obwohl diese grafische Darstellung lediglich Ordner anzeigt, werden die Dateien in die Größenermittlung zur Anzeige des von Ordnern belegten Platzes einbezogen.

source: translator-credits
de: Mario Blättermann <mario.blaettermann@t-online.de>, 2008
