Repository: mate-desktop/mate-utils
Catalog: baobab/help/*/*.po
Languages: de

source: @@image: 'figures/baobab_window.png'; md5=100896a46f48130752a9d88ac516fa3a
de: translated

source: @@image: 'figures/baobab_fullscan.png'; md5=17895f3407c9282a55a324642fd20e0b
de: translated

source: @@image: 'figures/baobab_remote.png'; md5=b11c5d1001dfbab2628df824a2660643
de: translated

source: @@image: 'figures/baobab_prefs.png'; md5=94dbb42d65cc8c32e50ac87bf9932811
de: translated

source: @@image: 'figures/baobab_treemaps.png'; md5=b553b49db25f9d6b98efcc394a5d3689
de: translated

source: @@image: 'figures/baobab_ringschart1.png'; md5=84b2e52d360fbda7311ce59a9532be7a
de: translated

source: @@image: 'figures/baobab_ringschart2.png'; md5=d938ef7e9299de5b304c7654bf14e364
de: translated

source: Disk Usage Analyzer Manual
de: Festplattenbelegungsanalyse-Handbuch

source: Disk Usage Analyzer is a graphical, menu-driven viewer that you can use to view and monitor your disk usage and folder structure.
de: Die Festplattenbelegungsanalyse ist ein grafischer, menügesteuerter Betrachter, den Sie zum Betrachten und Überwachen des Plattenplatzverbrauchs und der Ordnerstruktur verwenden können.

source: MATE Documentation Project
de: MATE-Dokumentationsprojekt

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink type="help" url="help:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
de: Das vorliegende Dokument kann gemäß den Bedingungen der GNU Free Documentation License (GFDL), Version 1.1 oder jeder späteren, von der Free Software Foundation veröffentlichten Version ohne unveränderbare Abschnitte sowie ohne Texte auf dem vorderen und hinteren Buchdeckel kopiert, verteilt und/oder modifiziert werden. Eine Kopie der GFDL finden Sie unter diesem <ulink type="help" url="help:fdl">Link</ulink> oder in der mit diesem Handbuch gelieferten Datei COPYING-DOCS.

source: This manual is part of a collection of MATE manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
de: Dieses Handbuch ist Teil einer Sammlung von MATE-Handbüchern, die unter der GFDL veröffentlicht werden. Wenn Sie dieses Handbuch getrennt von der Sammlung weiterverbreiten möchten, können Sie das tun, indem Sie eine Kopie der Lizenz zum Handbuch hinzufügen, wie es in Abschnitt 6 der Lizenz beschrieben ist.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any MATE documentation, and the members of the MATE Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
de: Viele der Namen, die von Unternehmen verwendet werden, um ihre Produkte und Dienstleistungen von anderen zu unterscheiden, sind eingetragene Warenzeichen. An den Stellen, an denen diese Namen in einer MATE-Dokumentation erscheinen, werden die Namen in Großbuchstaben oder mit einem großen Anfangsbuchstaben geschrieben, wenn das MATE-Dokumentationsprojekt auf diese Warenzeichen hingewiesen wird.

source: DOCUMENT IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER; AND
de: DIESES DOKUMENT WIRD »WIE VORLIEGEND« GELIEFERT, OHNE GARANTIEN IRGENDEINER ART, SOWOHL AUSDRÜCKLICH GENANNTE ALS AUCH ANGEDEUTETE. DIES BEZIEHT SICH AUCH OHNE EINSCHRÄNKUNG AUF GARANTIEN, DASS DIESES DOKUMENT ODER VERÄNDERTE FASSUNGEN DIESES DOKUMENTS FREI VON HANDELSDEFEKTEN, FÜR EINEN BESTIMMTEN ZWECK GEEIGNET IST ODER DASS ES KEINE RECHTE DRITTER VERLETZT. DAS VOLLE RISIKO WAS QUALITÄT, GENAUIGKEIT UND LEISTUNG DES DOKUMENTS ODER VERÄNDERTE FASSUNGEN DES DOKUMENTS LIEGT BEI IHNEN. SOLLTE EIN DOKUMENT ODER EINE VERÄNDERTE FASSUNG DAVON FEHLER IRGENDEINER ART BEINHALTEN, TRAGEN SIE (NICHT DER URSPRUNGSAUTOR, DER AUTOR ODER EIN MITWIRKENDER) DIE KOSTEN FÜR NOTWENDIGE DIENSTLEISTUNGEN, REPARATUREN ODER FEHLERKORREKTUREN. DIESER HAFTUNGSAUSSCHLUSS IST EIN ESSENZIELLER TEIL DIESER LIZENZ. DIE VERWENDUNG EINES DOKUMENTS ODER EINER VERÄNDERTEN VERSION DES DOKUMENTS IST NICHT GESTATTET AUßER UNTER BEACHTUNG DIESES HAFTUNGSAUSSCHLUSSES UND

source: UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE AUTHOR, INITIAL WRITER, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER DAMAGES OR LOSSES ARISING OUT OF OR RELATING TO USE OF THE DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.
de: UNTER KEINEN UMSTÄNDEN UND AUF BASIS KEINER RECHTSGRUNDLAGE, EGAL OB DURCH UNERLAUBTEN HANDLUNGEN (EINSCHLIEßLICH FAHRLÄSSIGKEIT), VERTRAG ODER ANDERWEITIG KANN DER AUTOR, URSPRUNGSAUTOR, EIN MITWIRKENDER ODER EIN VERTRIEBSPARTNER DIESES DOKUMENTS ODER EINER VERÄNDERTEN FASSUNG DES DOKUMENTS ODER EIN ZULIEFERER EINER DIESER PARTEIEN, HAFTBAR GEMACHT WERDEN FÜR DIREKTE, INDIREKTE, SPEZIELLE, VERSEHENTLICHE ODER FOLGESCHÄDEN JEGLICHER ART, EINSCHLIEßLICH UND OHNE EINSCHRÄNKUNGEN SCHÄDEN DURCH VERLUST VON KULANZ, ARBEITSAUSFALL, COMPUTERVERSAGEN ODER COMPUTERFEHLFUNKTIONEN ODER ALLE ANDEREN SCHÄDEN ODER VERLUSTE, DIE SICH AUS ODER IN VERBINDUNG MIT DER VERWENDUNG DES DOKUMENTS UND VERÄNDERTER FASSUNGEN DES DOKUMENTS ERGEBEN, AUCH WENN DIE OBEN GENANNTEN PARTEIEN ÜBER DIE MÖGLICHKEIT SOLCHER SCHÄDEN INFORMIERT WAREN.

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <placeholder-1/>
de: DAS DOKUMENT UND VERÄNDERTE FASSUNGEN DES DOKUMENTS WERDEN UNTER DEN BEDINGUNGEN DER GNU FREE DOCUMENTATION LICENSE ZUR VERFÜGUNG GESTELLT MIT DEM WEITERGEHENDEN VERSTÄNDNIS, DASS: <placeholder-1/>

source: Disk Usage Analyzer Manual 1.0
de: Festplattenbelegungsanalyse-Handbuch 1.0

source: This manual describes version 2.15 of Disk Usage Analyzer.
de: Dieses Handbuch beschreibt Version 2.15 der Festplattenbelegungsanalyse.

source: Feedback
de: Rückmeldungen

source: To report a bug or make a suggestion regarding the Disk Usage Analyzer application or this manual, follow the directions in the <ulink url="help:mate-feedback" type="help">MATE Feedback Page</ulink>.
de: Um einen Fehler zu melden oder einen Vorschlag zur Festplattenbelegungsanalyse oder zu diesem Handbuch zu machen, folgen Sie den Anweisungen auf der <ulink url="help:mate-feedback" type="help">MATE-Seite für Rückmeldungen</ulink>.

source: Disk Usage Analyser
de: Festplattenbelegungsanalyse

source: Introduction
de: Einführung

source: <application>Disk Usage Analyzer</application> is a graphical, menu-driven application to analyse disk usage in any Mate environment. <application>Disk Usage Analyzer</application> can easily scan either the whole filesystem tree, or a specific user-requested directory branch (local or remote).
de: <application>Festplattenbelegungsanalyse</application> ist eine grafische, menügesteuerte Anwendung zum Analysieren des Plattenplatzverbrauchs in jeder MATE-Arbeitsumgebung. Die <application>Festplattenbelegungsanalyse</application> kann entweder das gesamte Dateisystem einlesen, oder einen bestimmten, benutzerdefinierten Ordnerzweig (lokal oder entfernt).

source: It also auto-detects in real-time any changes made to your home directory as far as any mounted/unmounted device. <application>Disk Usage Analyzer</application> also provides a full graphical treemap window for each selected folder.
de: Es erkennt auch automatisch in Echtzeit jegliche Änderungen sowohl in Ihrem persönlichen Ordner als auch auf jedem eingebundenen oder nicht eingebundenen Laufwerk. Die <application>Festplattenbelegungsanalyse</application> stellt dabei für jeden gewählten Ordner ein Fenster mit einer Baumansicht bereit.

source: Getting Started
de: Erste Schritte

source: <application>Disk Usage Analyzer</application> can be started in three ways:
de: Die <application>Festplattenbelegungsanalyse</application> kann auf drei verschiedene Arten gestartet werden:

source: from Mate menu <menuchoice><guimenu>Applications</guimenu><guimenuitem>Accessories</guimenuitem></menuchoice>;
de: aus dem MATE-Menü <menuchoice><guimenu>Anwendungen</guimenu><guimenuitem>Werkzeuge</guimenuitem></menuchoice>;

source: from a terminal window;
de: in einem Terminalfenster

source: from Caja "Open with..." ;
de: in Caja durch »Öffnen mit …«

source: If you want to start <application>Disk Usage Analyzer</application> from a terminal window, just type:
de: Falls Sie die <application>Festplattenbelegungsanalyse</application> in einem Terminalfenster starten wollen, geben Sie ein:

source: <command>baobab &lt;full_path_to_a_directory&gt;</command>, then press <keycap>Return</keycap>.
de: <command>baobab &lt;kompletter_Pfad_zum_Ordner&gt;</command>, dann drücken Sie die <keycap>Eingabetaste</keycap>.

source: If launched from Mate menu, <application>Disk Usage Analyzer</application> starts and remains in a stand-by state, waiting for user action.
de: Falls Sie die <application>Festplattenbelegungsanalyse</application> aus dem MATE-Menü starten, verbleibt die Anwendung in einer Wartestellung und wartet auf eine Eingabe des Benutzers.

source: When you start <application>Disk Usage Analyzer</application> from the Mate Menu, the following window is displayed.
de: Wenn Sie die <application>Festplattenbelegungsanalyse</application> aus dem MATE-Menü starten, wird folgendes Fenster angezeigt:

source: Disk Usage Analyzer Window
de: Festplattenbelegungsanalyse-Fenster

source: Shows Disk Usage Analyzer main window. Contains menubar, display area, scrollbars, and statusbar.
de: Zeigt das Hauptfenster der Festplattenbelegungsanalyse. Enthält Menüleiste, Anzeigebereich, Rollbalken und Statusleiste.

source: The user can then:
de: Der Benutzer kann dann:

source: start a full filesystem scan;
de: das Einlesen des kompletten Dateisystems starten;

source: select a specific local directory branch to scan
de: einen bestimmten Ordnerzweig zum Einlesen auswählen

source: select a remote server and folder to scan
de: entfernten Server und Ordner zum Einlesen auswählen

source: set preferences
de: Einstellungen ändern

source: If you run a full filesystem scan, <application>Disk Usage Analyzer</application> window will start drawing the tree as soon as the thread starts scanning the filesystem. If any large partition is mounted on the filesystem, that will be scanned too.
de: Wenn Sie das komplette Dateisystem einlesen wollen, beginnt die <application>Festplattenbelegungsanalyse</application> mit dem Zeichnen des Dateibaums, sobald das Einlesen des Dateisystems beginnt. Wenn irgendeine große Partition im Dateisystem eingebunden ist, wird diese ebenfalls eingelesen.

source: Usage
de: Benutzung

source: Full filesystem scan
de: Das gesamte Dateisystem einlesen

source: To start a full filesystem scan select <menuchoice><guimenu>Analyzer</guimenu><guimenuitem>Scan Filesystem</guimenuitem></menuchoice> from the menu, or press on the <guibutton>Scan Filesystem</guibutton> toolbar button.
de: Um das Einlesen des kompletten Dateisystems zu starten, wählen Sie <menuchoice><guimenu>Aktionen</guimenu><guimenuitem>Dateisystem einlesen</guimenuitem></menuchoice> aus dem Menü, oder klicken Sie auf die Schaltfläche <guibutton>Dateisystem einlesen</guibutton> in der Werkzeugleiste.

source: When the scanning process ends up, you will get the full tree of your filesystem, like the one in the next Figure.
de: Wenn der Einlesevorgang beendet ist, erhalten Sie einen kompletten Baum Ihres Dateisystems, wie diesen im nächsten Bild.

source: Disk Usage Analyzer Full filesystem scan
de: Einlesen des kompletten Dateisystems mit der Festplattenbelegungsanalyse

source: Shows Disk Usage Analyzer full filesystem scan window. Contains menubar, display area, scrollbars, and statusbar.
de: Zeigt das Festplattenbelegungsanalyse-Fenster beim Einlesen des kompletten Dateisystems. Enthält Menüleiste, Anzeigebereich, Rollbalken und Statusleiste.

source: When you run a full filesystem scan, <application>Disk Usage Analyzer</application> window will start drawing the tree as soon as the thread starts scanning the filesystem. If any large partition is mounted on the filesystem, that will be scanned too.
de: Wenn Sie das komplette Dateisystem einlesen wollen, beginnt die <application>Festplattenbelegungsanalyse</application> mit dem Zeichnen des Dateibaums, sobald das Einlesen des Dateisystems beginnt. Wenn irgendeine große Partition im Dateisystem eingebunden ist, wird diese ebenfalls eingelesen.

source: <application>Disk Usage Analyzer</application> will display sizes in the directory tree as allocated space. This means that the displayed sizes refer to the actual disk usage and not to the apparent directory size. If you want to view the apparent file size, uncheck <menuchoice><guimenu>View</guimenu><guimenuitem>Allocated Space</guimenuitem></menuchoice> .
de: Die <application>Festplattenbelegungsanalyse</application> zeigt die Größen im Dateibaum als zugewiesenen Platz an. Das bedeutet, dass die angezeigten Größen sich auf den gegenwärtigen Platzverbrauch auf dem Laufwerk beziehen und nicht auf die augenscheinliche Größe des Ordners. Wenn Sie die augenscheinliche Größe des Ordners sehen wollen, deaktivieren Sie das Kontrollkästchen im Menü <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Belegter Speicherplatz</guimenuitem></menuchoice>.

source: <application>Disk Usage Analyzer</application> will not count the /proc dir, nor any file size that is not related to a "plain" file, so symlinks, character blocks, device blocks will not be part of the directory size.
de: Die <application>Festplattenbelegungsanalyse</application> bezieht den Ordner /proc dabei nicht ein, ebenso werden andere Dateien, die keine regulären Dateien sind, wie symbolische Verknüpfungen, zeichenorientierte Gerätedateien oder blockorientierte Gerätedateien nicht als Teil der Ordnergröße berücksichtigt.

source: Hard-links are managed in a different way: this first hardlink is counted as a normal file, while the subsequent links to the same inode device are not counted in the total, but highlighted in the right-hand column of the window.
de: Harte Verknüpfungen werden auf verschiedene Arten behandelt. Die erste harte Verknüpfung wird als normale Datei anerkannt, während die späteren Verknüpfungen zum gleichen Geräte-I-Node in der Gesamtbelegung nicht mitgezählt, jedoch in der rechten Spalte des Fensters hervorgehoben werden.

source: Single folder scan
de: Einen Ordner einlesen

source: To start a single folder scan select <menuchoice><guimenu>Analyzer</guimenu><guimenuitem>Scan Folder...</guimenuitem></menuchoice> from the menu, or press on the <guibutton>Scan Folder</guibutton> toolbar button.
de: Um das Einlesen eines einzelnen Ordners zu starten, wählen Sie <menuchoice><guimenu>Aktionen</guimenu><guimenuitem>Ordner einlesen</guimenuitem></menuchoice> aus dem Menü, oder klicken Sie auf die Schaltfläche <guibutton>Ordner einlesen</guibutton> in der Werkzeugleiste.

source: Remote scan
de: Einen entfernten Ordner einlesen

source: If you need to scan a remote server-folder, just click on the toolbar icon <guibutton>Scan Remote Folder</guibutton> or select <menuchoice><guimenu>Analyzer</guimenu><guimenuitem>Scan Remote Folder</guimenuitem></menuchoice> from the menu and you will get the following dialog box. <application>Disk Usage Analyzer</application> can connect to a server through ssh, ftp, smb, http and https.
de: Wenn Sie einen Ordner auf einem entfernten Server einlesen wollen, klicken Sie auf das Symbol <guibutton>Entfernten Ordner einlesen</guibutton> in der Werkzeugleiste, oder wählen Sie <menuchoice><guimenu>Aktionen</guimenu><guimenuitem>Entfernten Ordner einlesen</guimenuitem></menuchoice> im Menü, und das folgende Dialogfeld wird angezeigt. Die <application>Festplattenbelegungsanalyse</application> kann sich mit einem Server über die Protokolle SSH, FTP, SMB, HTTP und HTTPS verbinden.

source: Disk Usage Analyzer Remote folder scan
de: Einlesen entfernter Ordner mit der Festplattenbelegungsanalyse

source: Shows Disk Usage Analyzer remote folder dialog window.
de: Zeigt das Dialogfenster der Festplattenbelegungsanalyse für entfernte Ordner.

source: Preferences
de: Einstellungen

source: To change the <application>Disk Usage Analyzer</application> application preferences, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice>.
de: Um die Einstellungen der <application>Festplattenbelegungsanalyse</application> zu ändern, wählen Sie <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einstellungen</guimenuitem></menuchoice>.

source: Disk Usage Analyzer Preferences Window
de: Einstellungsfenster der Festplattenbelegungsanalyse

source: Preferences window
de: Einstellungsfenster

source: Select devices to be scanned
de: Laufwerke zum Einlesen auswählen

source: In the first part of the Preferences window, all detected mounted devices are listed. Click on the checkbox to include/exclude the partition into the filesystem scanning operations.
de: Im ersten Abschnitt des Einstellungsfensters werden alle gefundenen und eingebundenen Laufwerke aufgelistet. Klicken Sie in das Kontrollkästchen, um eine Partition in das Einlesen des Dateisystems einzuschließen beziehungsweise davon auszuschließen.

source: The device mounted on "/" cannot be excluded from the scan.
de: Das Laufwerk, das unter »/« eingebunden ist, kann nicht ausgeschlossen werden.

source: Enable monitoring of home
de: Persönlichen Ordner überwachen

source: If this option is checked, <application>Disk Usage Analyzer</application> will constantly monitor any external changes to home directory and warn the user if a file is added/removed.
de: Falls diese Option ausgewählt ist, überwacht die <application>Festplattenbelegungsanalyse</application> alle externen Änderungen an Ihrem persönlichen Ordner und warnt den Benutzer, falls eine Datei hinzugefügt oder entfernt wird.

source: <guilabel>Treemap</guilabel> concepts have been developed by Ben Shneiderman in the '90s. Read his <ulink type="http" url="http://www.cs.umd.edu/hcil/treemap-history/index.shtml">vision on treemaps</ulink>.
de: <guilabel>Treemap</guilabel>-Konzepte wurden von Ben Shneiderman in den Neunziger Jahren des vorigen Jahrhunderts entwickelt. Lesen Sie seine <ulink type="http" url="http://www.cs.umd.edu/hcil/treemap-history/index.shtml">Vision von Treemaps</ulink>.

source: Disk Usage Analyzer Treemap Window
de: Treemap-Fenster der Festplattenbelegungsanalyse

source: Treemap's theory. Shows 2 treemap diagrams
de: Treemap-Theorie. Zeigt zwei Treemap-Diagramme

source: Figure shows an example of treemap's theory. Each node (as shown in the tree diagram) has a name (a letter) and an associated size (a number). The size of leaves may represent for instance the size of individual files, the size of non-leaf nodes is the sum of the sizes of its children.
de: Das Bild zeigt ein Beispiel der Treemaps-Theorie. Jeder Knotenpunkt (wie im Diagramm angezeigt) hat einen Namen (einen Buchstaben) und eine zugehörige Größe (eine Zahl). Die Größe der Zweige repräsentiert beispielsweise die Größe der individuellen Dateien, die Größe der Knotenpunkte entspricht der Größe der Unterordner.

source: The treemap is constructed via recursive subdivision of the initial rectangle. The size of each sub-rectangle corresponds to the size of the node. The direction of subdivision alternates per level: first horizontally, next vertically, etcetera. As a result, the initial rectangle is partitioned into smaller rectangles, such that the size of each rectangle reflects the size of the leaf. The structure of the tree is also reflected in the treemap, as a result of its construction. Color and annotation can be used to give extra information about the leaves.
de: Die Treemap wird aus rekursiven Unterteilungen des ursprünglichen Rechtecks gebildet. Die Größe jedes der Teil-Rechtecke bezieht sich auf die Größe des jeweiligen Knotenpunkts. Die Richtung der Unterteilung wird in jeder Ebene umgekehrt: Zunächst waagerecht, dann senkrecht, usw. Als Ergebnis wird das ursprüngliche Rechteck in kleinere Rechtecke aufgeteilt, so dass die Größe jedes der Rechtecke die Größe des jeweiligen Zweiges widerspiegelt. Die Struktur des Baums wird so auch in der Treemap abgebildet, als Ergebnis von deren Konstruktionsweise. Die Farbgebung und die Beschriftungen können für die Bereitstellung zusätzlicher Informationen über die Zweige verwendet werden.

source: Treemaps are very effective when size is the most important feature to be displayed.
de: Treemaps sind sehr effektiv, wenn die Größe das wichtigste anzuzeigende Merkmal ist.

source: Ringschart
de: Ringdiagramm

source: <guilabel>Ringschart</guilabel> is a graphical representation of the disk usage by a concrete folder. When launching the application, it is notified the usage of the file system as it can be seen in the next figure:
de: Ein <guilabel>Ringdiagramm</guilabel> ist eine grafische Darstellung des Plattenplatzverbrauchs eines bestimmten Ordners. Wenn Sie die Anwendung starten, wird der Platzverbrauch des Dateisystems dargestellt, wie in der folgenden Abbildung zu sehen ist:

source: Disk Usage Analyzer showing a ringschart with the file system usage
de: Die Festplattenbelegungsanalyse zeigt ein Ringdiagramm mit dem Platzverbrauch des Systems

source: After launching the application, it is showed the file system usage. Graphical representation on the right.
de: Nach dem Start der Anwendung wird der Platzverbrauch des Dateisystems angezeigt, rechts in einer grafischen Darstellung.
